DataProcessors/Renault_ОбменРеноПартс.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>Renault_ОбменРеноПартс</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_НастройкиОбменаСРеноПартс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/ОстаткиТоваровКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваровКомпании</Name>
			<Comment>Блок учета остатков товаров компании</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количественный остаток номенклатуры на складе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Comment>Количество зарезервированного товара на складе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРозн</Name>
					<Comment>Розничная сумма в валюте регламентированного учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПереоценки</Name>
					<Comment>Количество, переоцененного товара</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена после переоценки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент или подразделение получатель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Comment>Сумма скидки в валюте регл. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/Renault_КаталогРеферансов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_КаталогРеферансов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Comment>Наименование номенклатуры</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КратностьПоставок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапретЗакупки</Name>
					<Comment>Запрет закупки номенклатуры</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТехСемья</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Нетто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Брутто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Габариты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сегмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_Сегменты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаличиеВSAPе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрямаяПоставка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодоваяЗапчасть</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>PVI</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ТипыPVI</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодСкидки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентПоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолныйАртикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Артикул</Name>
					<Comment>№ по каталогу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_СкидкиОптовыеПокупатели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_СкидкиОптовыеПокупатели</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Процент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛокальнаяСкидка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ГруппаКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ГруппыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ЗаказыПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыПокупателей</Name>
			<Comment>Заказы покупателей</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Заказано</Name>
					<Comment>Количество номенклатуры по заказу</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Comment>Количество номенклатуры, зарезервированной на складе для этого заказа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезервСвободный</Name>
					<Comment>Количество номенклатуры, зарезервированной на складе для этого заказа из свободного остатка</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма заказанной номенклатуры в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма заказанной номенклатуры в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Comment>Вид операции с заказом(заказ, резервирование...)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийЗаказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЗамены</Name>
					<Comment>Идентификатор операции замены заказанного товара на другой</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент, разместивший заказ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Comment>Документ оформления заказа</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРемонт</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказВнутренний</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказIT</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура заказа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры заказа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании на котором был зарезервирован товар для этого заказа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

DataProcessors/Renault_ОбменРеноПартс/Ext/ObjectModule.bsl
#Область СлужебныеПроцедурыИФункции

// Функция - Получить адрес
//
// Параметры:
//  ИмяСервиса	 - Строка - Имя HTTP сервиса
// 
// Возвращаемое значение:
//  Строка - Адрес ресурса
//
Функция ПолучитьАдрес(ИмяСервиса)

	Возврат НастройкаОбмена.Путь + ИмяСервиса + "/";

КонецФункции // ПолучитьАдрес()

// Создает и возвращает HTTP соединение
// 
// Возвращаемое значение:
//  HTTPСоединение - HTTP Соединение с сервером Рено Партс
//
Функция СоздатьСоединение()

    Возврат Новый HTTPСоединение(НастройкаОбмена.Сервер,
	                             НастройкаОбмена.Порт,
								 НастройкаОбмена.Пользователь,
                                 НастройкаОбмена.Пароль);

КонецФункции // СоздатьСоединение()

#КонецОбласти


#Область ВыгрузкаОстатков

// Возвращает массив структур данных об остатках запчастей
// 
// Возвращаемое значение:
//  Маасив - Массив структур данных об остатках
//
Функция ПолучитьОстаткиЗапчастей()

    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
                   |	Renault_НастройкиОбменаСРеноПартсСкладыОстатков.Склад
                   |ПОМЕСТИТЬ ВТ_СкладыОстатков
                   |ИЗ
                   |	Справочник.Renault_НастройкиОбменаСРеноПартс.СкладыОстатков КАК Renault_НастройкиОбменаСРеноПартсСкладыОстатков
                   |ГДЕ
                   |	Renault_НастройкиОбменаСРеноПартсСкладыОстатков.Ссылка = &НастройкаОбмена
                   |
                   |СГРУППИРОВАТЬ ПО
                   |	Renault_НастройкиОбменаСРеноПартсСкладыОстатков.Склад
                   |;
                   |
                   |////////////////////////////////////////////////////////////////////////////////
                   |ВЫБРАТЬ
                   |	ОстаткиТоваровКомпанииОстатки.Номенклатура.Артикул КАК NumCat,
                   |	ОстаткиТоваровКомпанииОстатки.КоличествоОстаток - ОстаткиТоваровКомпанииОстатки.РезервОстаток КАК Balance
                   |ПОМЕСТИТЬ ВТ_Итоговая
                   |ИЗ
                   |	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(
                   |			,
                   |			СкладКомпании В
                   |				(ВЫБРАТЬ
                   |					СкладыОстатков.Склад
                   |				ИЗ
                   |					ВТ_СкладыОстатков КАК СкладыОстатков)) КАК ОстаткиТоваровКомпанииОстатки
                   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_КаталогРеферансов КАК Renault_КаталогРеферансов
                   |		ПО ОстаткиТоваровКомпанииОстатки.Номенклатура.Артикул = Renault_КаталогРеферансов.Артикул
                   |;
                   |
                   |////////////////////////////////////////////////////////////////////////////////
                   |ВЫБРАТЬ
                   |	ВТ_Итоговая.NumCat,
                   |	СУММА(ВТ_Итоговая.Balance) КАК Balance
                   |ИЗ
                   |	ВТ_Итоговая КАК ВТ_Итоговая
                   |ГДЕ
                   |	ВТ_Итоговая.NumCat <> 0
                   |
                   |СГРУППИРОВАТЬ ПО
                   |	ВТ_Итоговая.NumCat";

	Запрос.УстановитьПараметр("НастройкаОбмена", НастройкаОбмена);			   

    Выборка = Запрос.Выполнить().Выбрать();

    МассивОстатков = Новый Массив;
    Пока Выборка.Следующий() Цикл
        МассивОстатков.Добавить(Новый Структура("Reference, Qty", СокрЛП(ВРег(Выборка.NumCat)), Выборка.Balance));
    КонецЦикла;

    Возврат МассивОстатков;

КонецФункции // ПолучитьОстаткиЗапчастей()

// Формирует строку в формате JSON для выгрузки остатков
// 
// Возвращаемое значение:
//  Строка - Строка данных об остатках в формате JSON
//
Функция СформироватьЗапросПоОстаткам()

	ЗаписьJSON = Новый ЗаписьJSON;
    ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(,Символы.Таб));

    СтруктураЗапроса = Новый Структура;
    СтруктураЗапроса.Вставить("DMD", НастройкаОбмена.DMD);
    СтруктураЗапроса.Вставить("Stock", ПолучитьОстаткиЗапчастей());

    ЗаписатьJSON(ЗаписьJSON, СтруктураЗапроса);

    Возврат ЗаписьJSON.Закрыть();

КонецФункции // СформироватьЗапросПоОстаткам()

// Выгружает остатки запчастей в Рено Партс
//
Процедура ВыгрузитьОстатки() Экспорт

	ЗапросПоОстаткамJSON = СформироватьЗапросПоОстаткам();

	Запрос = Новый HTTPЗапрос(ПолучитьАдрес("UpdateStock")); 
	Запрос.Заголовки.Вставить("Content-Type", "application/json");
	Запрос.УстановитьТелоИзСтроки(ЗапросПоОстаткамJSON);

	Соединение = СоздатьСоединение();
	Ответ = Соединение.ОтправитьДляОбработки(Запрос);

	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
	СтруктураОтвета = ПрочитатьJSON(ЧтениеJSON);

	Если СтруктураОтвета.ReturnCode <> "H000" Тогда
		Сообщить("Ошибка " + СтруктураОтвета.ReturnCode);
		Возврат;
	КонецЕсли;

	Сообщить("Остатки успешно выгружены");

КонецПроцедуры // ВыгрузитьОстатки()

#КонецОбласти


#Область ОбновлениеКлиентов

// Возвращает массив структур групп контрагентов
// 
// Возвращаемое значение:
//  Массив - Массив структур групп контрагентов
//
Функция ПолучитьСписокГрупп()

    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
                   |    Renault_ГруппыКонтрагентов.Код,
                   |    Renault_ГруппыКонтрагентов.Наименование,
                   |    ЕСТЬNULL(Renault_СкидкиОптовыеПокупатели.Процент, 0) КАК Процент,
				   |    ЕСТЬNULL(Renault_СкидкиОптовыеПокупатели.ЛокальнаяСкидка, 0) КАК ЛокальнаяСкидка
                   |ИЗ
                   |    Справочник.Renault_ГруппыКонтрагентов КАК Renault_ГруппыКонтрагентов
                   |        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_СкидкиОптовыеПокупатели КАК Renault_СкидкиОптовыеПокупатели
                   |        ПО Renault_ГруппыКонтрагентов.Ссылка = Renault_СкидкиОптовыеПокупатели.ГруппаКонтрагента";
    Выборка = Запрос.Выполнить().Выбрать();

    МассивГрупп = Новый Массив;
    Пока Выборка.Следующий() Цикл
        МассивГрупп.Добавить(Новый Структура(
            "Name,Margin,LocalDiscount",
            Выборка.Наименование,
            Выборка.Процент,
			Выборка.ЛокальнаяСкидка
        ));
    КонецЦикла;

    Возврат МассивГрупп;

КонецФункции // ПолучитьСписокГрупп()

// Возвращает массив структур данных о клиентах
// 
// Возвращаемое значение:
//  Маасив - Массив структур данных о клиентах
//
Функция ПолучитьСписокКлиентов()
    
    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
                   |    Renault_ОптовыеПокупателиЗапЧастей.Код КАК ID,
                   |    Renault_ОптовыеПокупателиЗапЧастей.Наименование КАК Name,
                   |    Renault_ОптовыеПокупателиЗапЧастей.ГруппаКонтрагента.Наименование КАК GroupName,
                   |    Renault_ОптовыеПокупателиЗапЧастей.Активный КАК Active
                   |ИЗ
                   |    Справочник.Renault_ОптовыеПокупателиЗапЧастей КАК Renault_ОптовыеПокупателиЗапЧастей";
    
    Выборка = Запрос.Выполнить().Выбрать();

    МассивГрупп = Новый Массив;
    Пока Выборка.Следующий() Цикл
        МассивГрупп.Добавить(Новый Структура(
            "ID,Name,GroupName,Active",
            Выборка.ID,
            Выборка.Name,
            Выборка.GroupName,
            Выборка.Active
        ));
    КонецЦикла;

    Возврат МассивГрупп;

КонецФункции // ПолучитьСписокКлиентов()

// Формирует строку в формате JSON с данными клиентов
// 
// Возвращаемое значение:
//  Строка - Строка в формате JSON
//
Функция СформироватьЗапросПоКлиентам()

    ЗаписьJSON = Новый ЗаписьJSON;
    ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(,Символы.Таб));

    СтруктураЗапроса = Новый Структура;
    СтруктураЗапроса.Вставить("DMD", НастройкаОбмена.DMD);
    СтруктураЗапроса.Вставить("Groups", ПолучитьСписокГрупп());
    СтруктураЗапроса.Вставить("Customers", ПолучитьСписокКлиентов());

    ЗаписатьJSON(ЗаписьJSON, СтруктураЗапроса);

    Возврат ЗаписьJSON.Закрыть();

КонецФункции // СформироватьЗапросПоКлиентам()

// Обновляет данные о клиентах в Рено Партс
//
Процедура ОбновитьКлиентов() Экспорт

    Соединение = СоздатьСоединение();

    Запрос = Новый HTTPЗапрос(ПолучитьАдрес("UpdateCustomers"));
    Запрос.Заголовки.Вставить("Content-Type", "application/json");
    Запрос.УстановитьТелоИзСтроки(СформироватьЗапросПоКлиентам());

    Ответ = Соединение.ОтправитьДляОбработки(Запрос);

    ЧтениеJSON = Новый ЧтениеJSON;
    ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
    СтруктураОтвета = ПрочитатьJSON(ЧтениеJSON,, "Date");

    Если СтруктураОтвета.ReturnCode <> "H000" Тогда
        Сообщить("Ошибка " + СтруктураОтвета.ReturnCode);
        Возврат;
	КонецЕсли;

	Сообщить("Клиенты успешно синхронизированы");

КонецПроцедуры // ОбновитьКлиентов()

#КонецОбласти


#Область ПолучениеЗаказов

// Формирует строку в формате JSON для загрузки заказов 
// 
// Возвращаемое значение:
//  Строка - Строка в формате JSON
//
Функция СформироватьЗапросПоЗаказам()

    ЗаписьJSON = Новый ЗаписьJSON;
    ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(,Символы.Таб));

	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("From", НачалоДня(ЭтотОбъект.ДатаНачала));
	СтруктураЗапроса.Вставить("To",   КонецДня(ЭтотОбъект.ДатаОкончания));
	СтруктураЗапроса.Вставить("DMD",  НастройкаОбмена.DMD);

    ЗаписатьJSON(ЗаписьJSON, СтруктураЗапроса);

    Возврат ЗаписьJSON.Закрыть();

КонецФункции // СформироватьЗапросПоЗаказам()

// Записывает полученные заказы запчастей в базу
//
// Параметры:
//  МассивЗаказов	 - Массив - Массив данных о заказах запчастей
//
Процедура ЗаписатьЗаказы(МассивЗаказов)

    Для Каждого Заказ Из МассивЗаказов Цикл

        НомерДокумента = Формат(Заказ.Number, "ЧГ=0");

        Заявка = Документы.Renault_ЗаказЗапчастейПокупателя.НайтиПоРеквизиту("НомерЗаявки", НомерДокумента);
        Если ЗначениеЗаполнено(Заявка) Тогда
            Продолжить;  // Пропускаем уже созданную заявку
        КонецЕсли;

        Заявка = Документы.Renault_ЗаказЗапчастейПокупателя.СоздатьДокумент();
        Заявка.Дата = Заказ.Date;
        Заявка.НомерЗаявки = НомерДокумента;
		// Заявка.ДилерскийЦентр = НастройкаОбмена.
        Заявка.Клиент = Справочники.Renault_ОптовыеПокупателиЗапЧастей.НайтиПоКоду(Заказ.Customer); 

        Для Каждого Стр Из Заказ.Goods Цикл
            СтрТовары = Заявка.Запчасти.Добавить();
            СтрТовары.Артикул = Стр.Reference;
			СтрТовары.Номенклатура = Renault_ЗапчастиСервер.ПолучитьНоменклатуруПоКаталогу(Стр.Reference);
            СтрТовары.Количество = Стр.Qty;
            СтрТовары.Цена = Стр.Price;
            СтрТовары.Коэффициент = Стр.Discount;
            СтрТовары.Скидка = "-";
            СтрТовары.Сумма = СтрТовары.Количество * СтрТовары.Цена;
        КонецЦикла;

        Заявка.УстановитьНовыйНомер();
        Заявка.Записать();

    КонецЦикла;

КонецПроцедуры // ЗаписатьЗаказы()

// Получает данные о заказах запчастей
//
Процедура ПолучитьЗаказы() Экспорт

    Соединение = СоздатьСоединение();

    Запрос = Новый HTTPЗапрос(ПолучитьАдрес("GetOrders"));
    Запрос.Заголовки.Вставить("Content-Type", "application/json");
    Запрос.УстановитьТелоИзСтроки(СформироватьЗапросПоЗаказам());

    Ответ = Соединение.ОтправитьДляОбработки(Запрос);

    ЧтениеJSON = Новый ЧтениеJSON;
    ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
    СтруктураОтвета = ПрочитатьJSON(ЧтениеJSON,, "Date");

    Если СтруктураОтвета.ReturnCode <> "H000" Тогда
        Сообщить("Ошибка " + СтруктураОтвета.ReturnCode);
        Возврат;
    КонецЕсли;

    ЗаписатьЗаказы(СтруктураОтвета.Orders);

	Сообщить("Заказы успешно получены");

КонецПроцедуры // ПолучитьЗаказы()

#КонецОбласти


#Область ВыгрузкаРеализаций

// Выгружает данные о реализациях по заявкам
//
Процедура ВыгрузитьРеализации() Экспорт
	
	ДанныеДляВыгрузки = ПолучитьДанныеПоРеализациям();
	
	// Трояновский К.Е. 27.08.2019 11:49:33 {
	//Если ДанныеДляВыгрузки.Количество() > 0 Тогда
	//	
	//	ЗапросJSON = СформироватьЗапросПоРеализациям(ДанныеДляВыгрузки);
	//
	//	//Соединение = СоздатьСоединение();

	//	//Запрос = Новый HTTPЗапрос(ПолучитьАдрес("ServiceName")); 
	//	//Запрос.Заголовки.Вставить("Content-Type", "application/json");
	//	//Запрос.УстановитьТелоИзСтроки(ЗапросJSON);

	//	//Ответ = Соединение.ОтправитьДляОбработки(Запрос);

	//	//ЧтениеJSON = Новый ЧтениеJSON;
	//	//ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
	//	//СтруктураОтвета = ПрочитатьJSON(ЧтениеJSON);

	//	//Если СтруктураОтвета.ReturnCode <> "H000" Тогда
	//	//    Сообщить("Ошибка " + СтруктураОтвета.ReturnCode);
	//	//КонецЕсли;
	//	
	//КонецЕсли;
	
	Если ДанныеДляВыгрузки.Количество() > 0 Тогда
		Соединение = СоздатьСоединение();
		Запрос = Новый HTTPЗапрос(ПолучитьАдрес("PutInvoice")); 
		Запрос.Заголовки.Вставить("Content-Type", "application/json");
	КонецЕсли;
	
	Для Каждого ДанныеРеализации Из ДанныеДляВыгрузки Цикл
		
		ЗапросJSON = СформироватьЗапросПоРеализациям(ДанныеРеализации);
				
		Запрос.УстановитьТелоИзСтроки(ЗапросJSON);

		Ответ = Соединение.ОтправитьДляОбработки(Запрос);

		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
		СтруктураОтвета = ПрочитатьJSON(ЧтениеJSON);

		Если СтруктураОтвета.ReturnCode <> "H000" Тогда
		    Сообщить("Ошибка " + СтруктураОтвета.ReturnCode);
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;	
	// Трояновский К.Е. 27.08.2019 11:49:33 }
	
КонецПроцедуры // ВыгрузитьРеализации()

// Функция - Получить данные по реализациям
// 
// Возвращаемое значение:
//  Массив - Массив данных по реализациям для конвертации в формат JSON
//
Функция ПолучитьДанныеПоРеализациям()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	// Трояновский К.Е. 27.08.2019 11:30:21 {
	//"ВЫБРАТЬ
	//|	ЗаказыПокупателейОбороты.Регистратор КАК Реализация,
	//|	&DMD КАК DMD,
	//|	ЕСТЬNULL(Renault_ЗаказЗапчастейПокупателя.Клиент.Код, """") КАК КлиентКод,
	//|	Renault_ЗаказЗапчастейПокупателя.НомерЗаявки КАК НомерЗаявки,
	//|	ЗаказыПокупателейОбороты.Номенклатура.Артикул КАК Артикул,
	//|	СУММА(ЗаказыПокупателейОбороты.ЗаказаноРасход) КАК Количество,
	//|	СУММА(ЗаказыПокупателейОбороты.СуммаРасход) КАК Сумма
	//|ИЗ
	//|	РегистрНакопления.ЗаказыПокупателей.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК ЗаказыПокупателейОбороты
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Renault_ЗаказЗапчастейПокупателя КАК Renault_ЗаказЗапчастейПокупателя
	//|		ПО ЗаказыПокупателейОбороты.Заказ = Renault_ЗаказЗапчастейПокупателя.ЗаказПокупателя
	//|			И ЗаказыПокупателейОбороты.Контрагент = Renault_ЗаказЗапчастейПокупателя.Клиент.Контрагент
	//|ГДЕ
	//|	ЗаказыПокупателейОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваров
	//|	И Renault_ЗаказЗапчастейПокупателя.ДилерскийЦентр.DMD = &DMD
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ЗаказыПокупателейОбороты.Регистратор,
	//|	ЗаказыПокупателейОбороты.Номенклатура.Артикул,
	//|	Renault_ЗаказЗапчастейПокупателя.Клиент.Код,
	//|	Renault_ЗаказЗапчастейПокупателя.ДилерскийЦентр.BIR,
	//|	Renault_ЗаказЗапчастейПокупателя.НомерЗаявки,
	//|	ЕСТЬNULL(Renault_ЗаказЗапчастейПокупателя.Клиент.Код, """")
	//|ИТОГИ
	//|	МАКСИМУМ(DMD),
	//|	МАКСИМУМ(КлиентКод)
	//|ПО
	//|	Реализация";
	
	"ВЫБРАТЬ
	|	ЗаказыПокупателейОбороты.Регистратор КАК Реализация,
	|	&DMD КАК DMD,
	|	ЕСТЬNULL(Renault_ЗаказЗапчастейПокупателя.Клиент.Код, """") КАК Customer,
	|	ЗаказыПокупателейОбороты.Регистратор.Дата КАК InvoiceDate,
	|	ЗаказыПокупателейОбороты.Регистратор.Номер КАК InvoiceNumber,
	|	ЗаказыПокупателейОбороты.Номенклатура.Артикул КАК Reference,
	|	СУММА(ЗаказыПокупателейОбороты.ЗаказаноРасход) КАК Qty,
	|	СУММА(ЗаказыПокупателейОбороты.СуммаРасход) КАК Amount,
	|	Renault_ЗаказЗапчастейПокупателя.НомерЗаявки КАК Order
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК ЗаказыПокупателейОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Renault_ЗаказЗапчастейПокупателя КАК Renault_ЗаказЗапчастейПокупателя
	|		ПО ЗаказыПокупателейОбороты.Заказ = Renault_ЗаказЗапчастейПокупателя.ЗаказПокупателя
	|			И ЗаказыПокупателейОбороты.Контрагент = Renault_ЗаказЗапчастейПокупателя.Клиент.Контрагент
	|ГДЕ
	|	ЗаказыПокупателейОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваров
	|	И Renault_ЗаказЗапчастейПокупателя.ДилерскийЦентр.DMD = &DMD
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыПокупателейОбороты.Регистратор,
	|	ЗаказыПокупателейОбороты.Номенклатура.Артикул,
	|	Renault_ЗаказЗапчастейПокупателя.Клиент.Код,
	|	Renault_ЗаказЗапчастейПокупателя.ДилерскийЦентр.BIR,
	|	Renault_ЗаказЗапчастейПокупателя.НомерЗаявки,
	|	ЕСТЬNULL(Renault_ЗаказЗапчастейПокупателя.Клиент.Код, """")
	|ИТОГИ
	|	МАКСИМУМ(DMD),
	|	МАКСИМУМ(Customer),
	|	МАКСИМУМ(InvoiceDate),
	|	МАКСИМУМ(InvoiceNumber)
	|ПО
	|	Реализация";	
	// Трояновский К.Е. 27.08.2019 11:30:21 }
	
	Запрос.УстановитьПараметр("ДатаНачала", 	ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", 	КонецДня(ДатаОкончания));
	Запрос.УстановитьПараметр("DMD", 			НастройкаОбмена.DMD);
	                                    
	МассивДанных = Новый Массив;
	
	ВыборкаРеализации = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаРеализации.Следующий() Цикл
		
		МассивТоваров = Новый Массив;
		
		ВыборкаТовары = ВыборкаРеализации.Выбрать();
		
		Пока ВыборкаТовары.Следующий() Цикл
			
			// Трояновский К.Е. 27.08.2019 11:39:18 {
			//СтруктураТовара = Новый Структура("НомерЗаявки, Артикул, Количество, Сумма");
			СтруктураТовара = Новый Структура("Reference, Qty, Amount, Order");			
			// Трояновский К.Е. 27.08.2019 11:39:18 }
			ЗаполнитьЗначенияСвойств(СтруктураТовара, ВыборкаТовары);
			МассивТоваров.Добавить(СтруктураТовара);
			
		КонецЦикла;
		
		// Трояновский К.Е. 27.08.2019 11:41:01 {
		//СтруктураДанных = Новый Структура("НомерНакладной, ДатаНакладной, DMD, КлиентКод, МассивТоваров", 
		//	ВыборкаРеализации.Реализация.Номер, ВыборкаРеализации.Реализация.Дата, ВыборкаРеализации.DMD, ВыборкаРеализации.КлиентКод, МассивТоваров);
		СтруктураДанных = Новый Структура("DMD, Customer, InvoiceDate, InvoiceNumber, Goods");
		ЗаполнитьЗначенияСвойств(СтруктураДанных, ВыборкаРеализации);
		СтруктураДанных.Goods = МассивТоваров;
		// Трояновский К.Е. 27.08.2019 11:41:01 }
		
		МассивДанных.Добавить(СтруктураДанных);	
			
	КонецЦикла;
	
	Возврат МассивДанных;
	
КонецФункции // ПолучитьДанныеПоРеализациям()

// Формирует строку в формате JSON для выгрузки остатков
//
// Параметры:
//  ДанныеРеализаций - Массив - Массив данных реализаций для выгрузки
// 
// Возвращаемое значение:
//  Строка - Строка данных об остатках в формате JSON
//
Функция СформироватьЗапросПоРеализациям(ДанныеРеализаций)
	
	ЗаписьJSON = Новый ЗаписьJSON;
    ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(,Символы.Таб));

    ЗаписатьJSON(ЗаписьJSON, ДанныеРеализаций);

    Возврат ЗаписьJSON.Закрыть();
	
КонецФункции // СформироватьЗапросПоОстаткам()

#КонецОбласти
